Revit 2024 API
Part.ResetFaceOffset Method
 Resets the offset applied to the given part face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void ResetFaceOffset(
	Face face
)
Visual Basic
Public Sub ResetFaceOffset ( _
	face As Face _
)
Visual C++
public:
void ResetFaceOffset(
	Face^ face
)
Parameters
face
Type: Autodesk.Revit.DB.Face
 The face whose offset needs to be reset.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  face does not belong to the part.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Part Class
Autodesk.Revit.DB Namespace